# Ex2 - Getting and Knowing your Data

This time we are going to pull data directly from the internet. Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

## Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

## Step 2. Import the dataset from this address.Â¶

## Step 3. Assign it to a variable called chipo.

In [2]:
#url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
    
#chipo = pd.read_csv(url, sep = '\t')
#chipo.to_csv('./data/chipotle.csv',index=False)
#chipo.head()

In [3]:
chipo = pd.read_csv('../data/chipotle.csv')
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## Step 4. See the first 10 entries

In [4]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

## Step 5. What is the number of observations in the dataset?

In [5]:
chipo.shape[0]

4622

In [6]:
chipo.shape

(4622, 5)

In [7]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
order_id              4622 non-null int64
quantity              4622 non-null int64
item_name             4622 non-null object
choice_description    3376 non-null object
item_price            4622 non-null object
dtypes: int64(2), object(3)
memory usage: 180.6+ KB

## Step 6. What is the number of columns in the dataset?Â¶

In [8]:
chipo.shape[1]

5

## Step 7. Print the name of all the columns.Â¶

In [9]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

## Step 8. How is the dataset indexed?Â¶

In [10]:
chipo.index

RangeIndex(start=0, stop=4622, step=1)

## Step 9. Which was the most-ordered item?

In [12]:
chipo.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [13]:
c = chipo.groupby('item_name')
c = c.sum()

In [14]:
c = c.sort_values('quantity',ascending=False)
c.head(20)

                              order_id  quantity
item_name
Chicken Bowl                    713926       761
Chicken Burrito                 497303       591
Chips and Guacamole             449959       506
Steak Burrito                   328437       386
Canned Soft Drink               304753       351
Chips                           208004       230
Steak Bowl                      193752       221
Bottled Water                   175944       211
Chips and Fresh Tomato Salsa    100419       130
Canned Soda                      76396       126
Chicken Salad Bowl              117104       123
Chicken Soft Tacos               98395       120
Side of Chips                    84769       110
Veggie Burrito                   80962        97
Barbacoa Burrito                 74718        91
Veggie Bowl                      72270        87
Carnitas Bowl                    62742        71
Barbacoa Bowl                    53972        66
Carnitas Burrito                 51652        60
Steak Soft Tacos                 50177        56

In [15]:
c.head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

## Step 10. For the most-ordered item, how many items were ordered?Â¶

In [16]:
c = chipo.groupby('item_name')
c = c.sum()
c = c.sort_values(['quantity'], ascending=False)
c.head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

## Step 11. What was the most ordered item in the choice_description column?Â¶

In [17]:
c = chipo.groupby('choice_description').sum()
c.head()

                                                    order_id  quantity
choice_description
[Adobo-Marinated and Grilled Chicken, Pinto Bea...       214         1
[Adobo-Marinated and Grilled Chicken, [Sour Cre...       279         1
[Adobo-Marinated and Grilled Chicken]                    217         1
[Adobo-Marinated and Grilled Steak, [Sour Cream...       279         1
[Adobo-Marinated and Grilled Steak]                      217         1

In [18]:
c = c.sort_values(['quantity'], ascending=False)
c.head()

                                                    order_id  quantity
choice_description
[Diet Coke]                                           123455       159
[Coke]                                                122752       143
[Sprite]                                               80426        89
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese...     43088        49
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese...     36041        42

## Step 12. How many items were orderd in total?Â¶

In [19]:
total_items_orders = chipo.quantity.sum()
total_items_orders

4972

## Step 13. Turn the item price into a float

### Step 13.a. Check the item price typeÂ¶

In [20]:
chipo.item_price.dtype

dtype('O')

In [21]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
order_id              4622 non-null int64
quantity              4622 non-null int64
item_name             4622 non-null object
choice_description    3376 non-null object
item_price            4622 non-null object
dtypes: int64(2), object(3)
memory usage: 180.6+ KB

## Step 13.b. Create a lambda function and change the type of item priceÂ¶

In [22]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
order_id              4622 non-null int64
quantity              4622 non-null int64
item_name             4622 non-null object
choice_description    3376 non-null object
item_price            4622 non-null object
dtypes: int64(2), object(3)
memory usage: 180.6+ KB

In [23]:
chipo.shape

(4622, 5)

In [24]:
chipo.item_price[1:-1].shape

(4620,)

In [25]:
dollarizer = lambda x: float(x[1:-1])
chipo.item_price = chipo.item_price.apply(dollarizer)
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [26]:
chipo.item_price.dtype

dtype('float64')

## Step 14. How much was the revenue for the period in the dataset?Â¶

In [27]:
revenue = (chipo['quantity'] * chipo['item_price']).sum()

revenue

print('Revenue was : $' + str(np.round(revenue,2)))

Revenue was : $39237.02

## Step 15. How many orders were made in the period?

In [28]:
chipo.order_id.head()

0    1
1    1
2    1
3    1
4    2
Name: order_id, dtype: int64

In [29]:
chipo.order_id.value_counts()

926     23
1483    14
205     12
691     11
1786    11
759     11
491     10
1660     9
561      9
953      8
195      8
916      8
1006     8
818      8
577      7
1449     7
1443     7
511      7
1454     6
343      6
149      6
1586     6
389      6
1431     6
1655     6
231      6
488      6
848      6
1396     6
1156     6
        ..
1175     1
902      1
1183     1
1199     1
1336     1
777      1
1227     1
1634     1
821      1
1027     1
528      1
1023     1
863      1
137      1
581      1
59       1
819      1
831      1
593      1
605      1
616      1
556      1
871      1
2        1
1813     1
105      1
702      1
718      1
568      1
800      1
Name: order_id, Length: 1834, dtype: int64

In [30]:
chipo[chipo.order_id==1483]

,order_id,quantity,item_name,choice_description,item_price
3700,1483,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",8.75
3701,1483,1,Steak Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",11.75
3702,1483,1,Chicken Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",8.75
3703,1483,1,Steak Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",9.25
3704,1483,1,Steak Burrito,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",11.75
3705,1483,1,Steak Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Black...",9.25
3706,1483,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Pinto Beans, Chees...",8.75
3707,1483,1,Steak Bowl,"[Roasted Chili Corn Salsa, [Black Beans, Chees...",9.25
3708,1483,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",8.75
3709,1483,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",11.25
3710,1483,1,Steak Soft Tacos,"[Fresh Tomato Salsa, Guacamole]",11.75
3711,1483,1,Carnitas Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",9.25
3712,1483,1,Chicken Salad Bowl,"[Roasted Chili Corn Salsa, [Black Beans, Chees...",8.75
3713,1483,1,Steak Bowl,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",11.75

In [31]:
orders = chipo.order_id.value_counts().count()
orders

1834

In [32]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

## Step 16. What is the average revenue amount per order?Â¶

In [33]:
# Solution1

chipo['revenue'] = chipo['quantity'] * chipo['item_price']
chipo.head()
order_grouped = chipo.groupby('order_id').sum()
order_grouped.head()

          quantity  item_price  revenue
order_id
1                4       11.56    11.56
2                2       16.98    33.96
3                2       12.67    12.67
4                2       21.00    21.00
5                2       13.70    13.70

In [34]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
order_id              4622 non-null int64
quantity              4622 non-null int64
item_name             4622 non-null object
choice_description    3376 non-null object
item_price            4622 non-null float64
revenue               4622 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 216.7+ KB

In [35]:
chipo.order_id.value_counts().count()

1834

In [36]:
order_grouped.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1834 entries, 1 to 1834
Data columns (total 3 columns):
quantity      1834 non-null int64
item_price    1834 non-null float64
revenue       1834 non-null float64
dtypes: float64(2), int64(1)
memory usage: 57.3 KB

In [37]:
order_grouped.mean()

quantity       2.711014
item_price    18.811429
revenue       21.394231
dtype: float64

In [38]:
order_grouped.mean()['revenue']

21.394231188658654

In [39]:
chipo.groupby('order_id').sum().head()

          quantity  item_price  revenue
order_id
1                4       11.56    11.56
2                2       16.98    33.96
3                2       12.67    12.67
4                2       21.00    21.00
5                2       13.70    13.70

In [40]:
# Solution2
chipo.groupby(by='order_id').sum().mean()['revenue']

21.394231188658654

## Step 17. How many different items are sold?

In [41]:
chipo.item_name.value_counts().count()

50